import React ,{ useState } from 'react';

//icon
import Down from '../assets/images/Down'


const Source = () => {
    const [state , setState]=useState({
        item1:false,
        item2:false,
        item3:false,
        item4:false,
    })
    return (
        <>
            <li className='mb-5 pb-5 border-b-[1px] border-slate-300'>
                <div className='flex cursor-pointer select-none' onClick={()=>setState({...state,item1:!state.item1})}>
                    <Down item={state.item1}/>
                    <span className='font-semibold text-neutral-700'>چرا همه باید بلاگری کنند؟</span>
                </div>
                    <span className={state.item1?'block mt-5':'hidden'}>فرض کنید شما اکانت اینستاگرام یا توِئییتر خودتون رو راه اندازی کردین. تولید محتوا کردین و تعدادی فالوور جذب کردید.
                        ه فکری راحب شما می کنن؟
                        چطور باید به شما اعتماد کنن؟
                        چرا اصلا باید به ما اعتماد کنن!؟
                        اگه حتی توی موضوع خودت متخصص باشی و مخاطب اینو ببینه توی محتوا ، اما بازم اعتماد کسی رو بدست آوردن آسون نیست.<br />
                        راه داره.
                        این راه بلاگری کردنه!
                        الان با هر تخصصی توی اینستاگرام هم لازمه که بلاگری کنیم!<br />
                        مخاطب شما  با محتوای بلاگری شما درگیر می شه و اطلاعاتی که از شما می گیره که ممکنه وقتی به دردش بخوره ، خلاصه درگیر شما میشه .
                        این یعنی زمان بیشتری روی شما وقت میذاره و برد\برد
                        و دومبن چیزی که به ما میده همون اعتماده. همون مهم بودن نظر ما برای مخاطب.
                        همه ی پبج ها.<br />
                        سپس رو به دوربین می کند و با شما به زبان طنز درونش حرف میزند: آه
                    </span>
            </li>
            <li className='mb-5 pb-5 border-b-[1px] border-slate-300'>
                <div className='flex cursor-pointer select-none' onClick={()=>setState({...state,item2:!state.item2})}>
                    <Down item={state.item2}/>
                    <span className='font-semibold text-neutral-700'>بلاگر کیست؟</span>
                </div>
                    <span className={state.item2?'block':'hidden'}>
                        هر شخصی که با دانشی پایه  در فضای مجازی به صورت مداوم مطالبی  را منتشر کند بلاگر است.<br/>
                        نخیر جانم، همه ی  بلاگری عکس انداختن از شوهر سیببیلو و بچه ی کُپلی و نهار مامان شوشو پز و لوازم آرایشی مالیدن نیست . بلاگری فخر فروشی هم نیست . <br/> البته که این قِر و فر بازی ها هم جزو بلاگری کردن می توانند باشند ولی فخر فروشی و آرزو فروشی بلاگری نیست. یک کار احمقانه است! در سطح بلاگر های اولیه ( شبیه انسان اولیه) <br/>
                        مهم این است که شما و مخاطب درگیر بشوید و بدانید مخاطبتان چه میخواهد . 
                        دقیقا شبیه این است با مخاطب رل بزنید. از آن رل ها که فقط می زنند که زده باشند نه . یک رابطه با تعهد و سود رسانی دو طرفه ! همزیستی ! <br/>

                        بعضی مواقع همه با هم ممکن است نظر بدهند سیبیل زشت شوشو جان را بزنید خواهشا یا آن پرده های قرمزی که خیلی دوستشان دارید را باید عوض کنید چون اصلا دیگر به شما در استوری روزمره گوش نمی دهند و یک صدا میگوید عوض کن آن دامن ختنه را.
                        شاید هم یک لباس بپوشید که تعداد زیادی 👎 بگیرید.<br/>
                        بلاخره هر کاری هزینه ای دارد.<br/>
                        شما باید بدانید با مخاطب و نظر های گاه غیر گوگولی اش چگونه رفتار می کنید تا دکمه ی تان را نزند. <br/>
                        دکمه ی آنفالویتان .<br/>
                    </span>
            </li>
            <li className='mb-5 pb-5 border-b-[1px] border-slate-300'>
                <div className='flex cursor-pointer select-none' onClick={()=>setState({...state,item3:!state.item3})}>
                    <Down item={state.item3}/>
                    <span className='font-semibold text-neutral-700'>چگونه باید بلاگری کرد؟</span>
                </div>
                    <span className={state.item3?'block':'hidden'}>
                        جانم برایتان تفت بدهد که قضیه لقمان و ادب یاد گرفتن از خوب های ادب را یادتان است؟<br/>
                        من خیلی وقت بود که وبلاگ نویسی کرده بودم و یا بی هدف بلاگری در اینستاگرام ! با یک عده فالوور آشنا و البته کم نظر و راکد!<br/>
                        مدتی با پَسی های خود زده ، زیرم را جمع کردم و آموزش دیدم. خواندم . در همان پیج خشک فالوور کم خانم ( 77% فالوور های من آقا بودند) 💨 حتی ورودی زیادی از اکسپلور و هشتگ داشتم ولی چیز نداشتم . چیز...<br/>
                        این چیز رو یاد گرفتم و انقدر توی محتوا های خودش و موضوعات اطرافش غرق شدم که تصمیم گرفتم  بیام و اولا ثابت کنم داداشیتونم و دوم به شما هم هر نکته ای که توی این زمینه می تونه کمکتون کنه و من بلدم رو بگم . <br/>
                        پس جواب این سوال برای پست ها و بقیه محتوای پیج اینستاگرام من .
                    </span>
            </li>
            <li className=''>
                <div className='flex cursor-pointer select-none' onClick={()=>setState({...state,item4:!state.item4})}>
                    <Down item={state.item4}/>
                    <span className='font-semibold text-neutral-700'>که بودم ؟</span>
                </div>
                    <span className={state.item4?'block':'hidden'}>
                        محمد رسول پرویزی< br/>
                        زمان تحویل بسته توسط لک لک ها : < br/> شب بازی فینال جام جهانی 1998
                        ،متولد و ساکن تهران ، رشد یافته تو گلدون کرمانشاه،
                        پرستاری دانشگاه علوم پزشکی تهران 
                        علاقه مند به هنر ، نوشتن ، فیلم دیدن ، آموزش دادن ، ساختن ، تولید کردن 
                        وبلاگ نویس بی نام و مخوف قدیم که از بلاگفا تا صبح دل نمی کند . < br/>
                        تراوین( بازی آنلاین استراتژیک) باز قدیمی توی موقعیت جغد شب 😁.< br/>
                        حس میکردم توی کُشتی عالیم ولی می دونستم توی چمن بهتر بازی میکنم اما فوتسال بازی کردم ده سال.
                        توی هرکاری که می کنم سعی می کنم بهترین باشم.
                        انشالله ، آی سد انشاالله از الان .
                        < br/>
                        با داوطلب کله ی هر نوع کار اجرایی و کاپیتان شدن در دانشگاه و فاتح بسیاری از تپه ها بودم .< br/>
                        واکسیناتور  با سابقه ی  تزریق حدودا ۶ لیتر واکسن کرونا به مردم . 
                        تولید محتوا می کنم  و روی آموزش دادنش کار میکنم.< br/>
                        نشریات دانشجویی جزو تپه های مرتفعی بود که یک بار فردی خدمت رسید و با انگشت سوم سلام کرد و با حالت عمو یا دایی طور گفت: داداش میشه دیگه توی همه ی نشریات نریزی؟ دیگر نریختم . < br/>ریختم. تا آن سال ها که دل و دماغ داشتم ریختم . بعدش نریختم و روی من ریختند به چاییها را .< br/>
                        مسئولیت های اجرائی مختلفی بر عهده داشتم اما حالا هیچ کدام را جز بلاگری پا نگرفته ام. ″دبیر″ های کانون ها و گروه های مختلفی بودم حتی چند جا دبیر بودم که خودم هم هم نمی دانستم. می دانستم اما فقط میدانستم. زمان کم می آوردم . همه کاره بودم اما در آینه بار ها از خودم پرسیدم :< br/>
                        _شما؟ 🤔< br/>
                        _بوفم😌🖖< br/>
                        _فرمایش😒< br/>
                        _جهت کار مزاحم میشم🙄< br/>
                        _چیکاره ای؟< br/>
                        بعد هنگ می کردم و صفحه ی نمایشم لوگوی شرکت سازنده ام را نمایش میداد .
                        یک سال طول کشید تا افکار و تجربه هایم را آنالیز کنم و سیسیتم بچنیم که باید چه کیک یزدی ای بخورم.< br/>
                        در اینستاگرام بیشتر اموزش دیدم ، نه کرسی شعری. درست و حسابی.< br/>
                        اول میخواستم از کاری که از آن لذت میبیرم یعنی آشپزی کره بگیرم.< br/>
                        مَشکَه (پوسته ای که در آن دوغ را وحشیانه میزنند و کره میگیرند) و دوغم کره نداد. بیشتر که فکر کردم فهمیدم میتوانم دانسته هایم را از تولید محتوا و بلاگری برای شما بگویم و شما جان مادرتان یاد بگیرید &#128516;
                    </span>
            </li>
        </>
    );
};

export default Source;